Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ2064DAS176.PIC
      <edc:SFRDef edc:_addr="0x1F8E3178" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="USBE7CSR2" edc:desc="" edc:impl="0xffff3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000--00000000000000" edc:name="USBE7CSR2" edc:nzwidth="32" edc:por="0000000000000000--00000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXCNT" edc:desc="" edc:mask="0x3fff" edc:name="RXCNT" edc:nzwidth="14"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TEP" edc:desc="" edc:mask="0xf" edc:name="TEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PROTOCOL" edc:desc="" edc:mask="0x3" edc:name="PROTOCOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TXINTERV" edc:desc="" edc:mask="0xff" edc:name="TXINTERV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E317C" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnn--------nnnnnnnnnnnnnnnn" edc:cname="USBE7CSR3" edc:desc="" edc:impl="0xff00ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--------0000000000000000" edc:name="USBE7CSR3" edc:nzwidth="32" edc:por="00000000--------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEP" edc:desc="" edc:mask="0xf" edc:name="TEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PROTOCOL" edc:desc="" edc:mask="0x3" edc:name="PROTOCOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RXINTERV" edc:desc="" edc:mask="0xff" edc:name="RXINTERV" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="TXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="TXFIFOSZ" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="RXFIFOSZ" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3180" edc:offset="128"/>
      <edc:SFRDef edc:_addr="0x1F8E3200" edc:_begin="0x200" edc:_end="0x210" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="7" edc:access="------------------------nnnnnnnn" edc:cname="USBDMAINT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="USBDMAINT" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA8IF" edc:desc="" edc:mask="0x1" edc:name="DMA8IF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3204" edc:_begin="0x200" edc:_end="0x210" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="7" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA1C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA1C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3208" edc:_begin="0x200" edc:_end="0x210" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="7" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA1A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA1A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
